In [10]:
import pandas as pd
import numpy as np
df=pd.read_csv("../datasets/melb_data.csv")
df[df.isnull().any(axis=1)].iloc[-5:,14:17]

       BuildingArea  YearBuilt CouncilArea
13575           NaN     1981.0         NaN
13576         133.0     1995.0         NaN
13577           NaN     1997.0         NaN
13578         157.0     1920.0         NaN
13579         112.0     1920.0         NaN

## Pandas
Pandas is a Data Manipulaiton Library hat makes it easy to handle complex datasets.

Creating a DataFrame by passing a NumPy array, with labeled columns:

In [11]:
df = pd.DataFrame(np.random.randn(6, 4),  columns=list("ABCD"))

The columns of the resulting DataFrame have different dtypes.

If you’re using IPython, tab completion for column names (as well as public attributes) is automatically enabled. Here’s a subset of the attributes that will be completed:

In [12]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

## Viewing data
df.head()
df.tail(3)
df.describe()
df.sort_values(by="B")
df.sort_index(axis=1, ascending=False)

## Selecting Data

In [13]:
print(df["A"])

print(df.iloc[3:5, 0:2] )#selection by index

0    0.711198
1    0.326552
2    1.182634
3    1.305521
4    0.302218
5   -0.251031
Name: A, dtype: float64
          A         B
3  1.305521  0.713508
4  0.302218  2.265124

## Boolean indexing

In [14]:
print(df[df > 0])

          A         B         C         D
0  0.711198       NaN  0.230388  0.227714
1  0.326552       NaN       NaN  0.104969
2  1.182634  1.185896  0.658286       NaN
3  1.305521  0.713508       NaN  0.048853
4  0.302218  2.265124  0.684564  0.350826
5       NaN  1.324972  1.760301  0.908176

In [15]:
df.iloc[1,1] = "Hello"

df[df.isin(["Hello", "World"])]

    A      B   C   D
0 NaN    NaN NaN NaN
1 NaN  Hello NaN NaN
2 NaN    NaN NaN NaN
3 NaN    NaN NaN NaN
4 NaN    NaN NaN NaN
5 NaN    NaN NaN NaN

## Task1: Missing data
In the following Dataframe, some data is missing. Find a way to:
* 1: Remove the column containing the missing data
* 2:  Fill the missing column with the average of each row

In [16]:
df1 = df.reindex( columns=list(df.columns) + ["E"])
df1

          A         B         C         D   E
0  0.711198 -0.724628  0.230388  0.227714 NaN
1  0.326552     Hello -1.644045  0.104969 NaN
2  1.182634  1.185896  0.658286 -0.588709 NaN
3  1.305521  0.713508 -0.026937  0.048853 NaN
4  0.302218  2.265124  0.684564  0.350826 NaN
5 -0.251031  1.324972  1.760301  0.908176 NaN

# Task 2.1: Plotting

The variable *ts* below contains a randomly generated "time series" a dataset in which time is one of the axies.

* Calculate the **cumulative sum** of this series in a new series. The cumulative sum at index *i* is the sum of all entries in *ts* up until index *i*.
* Plot the cumulative sum using *matplotlib*

In [17]:
import matplotlib.pyplot as plt
ts = pd.Series(np.random.randn(1000), index=pd.date_range("1/1/2000", periods=1000))

# Task 2.2:  

Adapt the code above to plot 4 timeseries in the same plot, with A different colour and label for each timeseries.\
The output should look similar to this:\
![ ](..\img\output_2_2.png)

In [18]:
df = pd.DataFrame(
    np.random.randn(1000, 4), index=ts.index, columns=["A", "B", "C", "D"]
)